# Carga de aerolíneas (tabla dm_aerolineas)

Cargamos las librerías correspondientes

In [1]:
import pandas as pd
from sqlalchemy import create_engine

### Conexión a __MySQL__ BBDD __local__

#### Conectamos utilizando sqlalchemy

In [2]:
conn = create_engine("mysql+mysqlconnector://root:password@localhost/dw_aero")

Comprobamos conectividad con la base de datos

In [3]:
try:
    with conn.connect() as connection:
        print("Conexión exitosa.")
        # Aquí puedes realizar operaciones con la base de datos
except Exception as e:
    print(f"Ocurrió un error al conectar a la base de datos: {e}")

Conexión exitosa.

## Comenzamos con el trabajo

Comprobamos si existen datos en la tabla __dm_aerolineas__

In [4]:
pd.read_sql_table("dm_aerolineas", conn)

Empty DataFrame
Columns: [cod_aerolinea, nombre_aerolinea, cod_pais, cod_iata, cod_icao, identificacion, pais_aerolinea, sw_activa]
Index: []

Lectura del fichero aerolineas.csv

In [5]:
df_aerol1 = pd.read_csv("https://raw.githubusercontent.com/bintutr/Data-Integration/refs/heads/main/conexi%C3%B3n%20BBDD%20Mysql/Datasets/aerolineas.csv",  sep=',', header='infer')
df_aerol1.head()

,cod_aerolinea,nombre_aerolinea,cod_pais,cod_iata,cod_icao,identificacion,pais_aerolinea,sw_activa
0,00001,Private flight,Z99,Z9,Z99,I999,NaN,Y
1,00002,135 Airways,USA,Z9,GNL,GENERAL,United States,N
2,00003,1Time Airline,ZAF,1T,RNX,NEXTIME,South Africa,Y
3,00004,2 Sqn No 1 Elementary Flying Training School,GBR,Z9,WYT,I999,United Kingdom,N
4,00005,213 Flight Unit,RUS,Z9,TFU,I999,Russia,N

Revisión de nulos

In [6]:
df_aerol1.isnull()

,cod_aerolinea,nombre_aerolinea,cod_pais,cod_iata,cod_icao,identificacion,pais_aerolinea,sw_activa
0,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...
6043,False,False,False,False,False,False,False,False
6044,False,False,False,False,False,False,False,False
6045,False,False,False,False,False,False,False,False
6046,False,False,False,False,False,False,False,False
6047,False,False,False,False,False,False,False,False

In [7]:
print(df_aerol1.isnull().values.any())

True

In [8]:
df_aerol1.isnull().sum()

cod_aerolinea        0
nombre_aerolinea     0
cod_pais             0
cod_iata             2
cod_icao             0
identificacion      11
pais_aerolinea      16
sw_activa            1
dtype: int64

In [9]:
df_aerol1[df_aerol1['cod_iata'].isnull()]

,cod_aerolinea,nombre_aerolinea,cod_pais,cod_iata,cod_icao,identificacion,pais_aerolinea,sw_activa
3592,03598,National Airlines,USA,NaN,NAL,NATIONAL,United States,N
5690,13190,Al-Naser Airlines,IRQ,NaN,Z99,I999,Iraq,Y

In [10]:
pd.read_sql_query('DESCRIBE dm_aerolineas;', conn)

              Field          Type Null  Key Default Extra
0     cod_aerolinea    varchar(5)   NO  PRI    None
1  nombre_aerolinea  varchar(100)   NO         None
2          cod_pais    varchar(3)  YES  MUL    None
3          cod_iata    varchar(3)  YES         None
4          cod_icao   varchar(10)  YES         None
5    identificacion  varchar(100)  YES         None
6    pais_aerolinea   varchar(45)  YES         None
7         sw_activa           int  YES         None

Reemplazo nulos cod_iata (3 pos - Z99)

In [11]:
df_aerol1['cod_iata'] = df_aerol1['cod_iata'].fillna('Z99')

In [12]:
df_aerol1[df_aerol1['cod_aerolinea']=='Z9999']

,cod_aerolinea,nombre_aerolinea,cod_pais,cod_iata,cod_icao,identificacion,pais_aerolinea,sw_activa
5511,Z9999,Desconocido,Z99,Z9,Z99,Z999,NaN,NaN

## Comprobaciones integridad país

Para realizar la comprobación de integridad primero cargamos los datos de países provenientes de la tabla __dm_pais__

In [13]:
df_pais = pd.read_sql_query('select cod_pais as cod_pais_verificado, pais from dm_pais', conn)
df_pais.head()

  cod_pais_verificado         pais
0                 ABW        Aruba
1                 AFG  Afghanistan
2                 AGO       Angola
3                 AIA     Anguilla
4                 ALB      Albania

### Cruce aeropuero - paises

In [14]:
df_aerol1.head()

,cod_aerolinea,nombre_aerolinea,cod_pais,cod_iata,cod_icao,identificacion,pais_aerolinea,sw_activa
0,00001,Private flight,Z99,Z9,Z99,I999,NaN,Y
1,00002,135 Airways,USA,Z9,GNL,GENERAL,United States,N
2,00003,1Time Airline,ZAF,1T,RNX,NEXTIME,South Africa,Y
3,00004,2 Sqn No 1 Elementary Flying Training School,GBR,Z9,WYT,I999,United Kingdom,N
4,00005,213 Flight Unit,RUS,Z9,TFU,I999,Russia,N

In [15]:
df_aerol2 = pd.merge(left=df_aerol1, right=df_pais,
                      how='left', left_on='cod_pais', right_on='cod_pais_verificado')

In [16]:
df_aerol2.head()

,cod_aerolinea,nombre_aerolinea,cod_pais,cod_iata,cod_icao,identificacion,pais_aerolinea,sw_activa,cod_pais_verificado,pais
0,00001,Private flight,Z99,Z9,Z99,I999,NaN,Y,Z99,desconocido
1,00002,135 Airways,USA,Z9,GNL,GENERAL,United States,N,USA,United States
2,00003,1Time Airline,ZAF,1T,RNX,NEXTIME,South Africa,Y,ZAF,South Africa
3,00004,2 Sqn No 1 Elementary Flying Training School,GBR,Z9,WYT,I999,United Kingdom,N,GBR,United Kingdom
4,00005,213 Flight Unit,RUS,Z9,TFU,I999,Russia,N,RUS,Russia

In [17]:
df_aerol2[df_aerol2['cod_pais_verificado'].isnull()]

Empty DataFrame
Columns: [cod_aerolinea, nombre_aerolinea, cod_pais, cod_iata, cod_icao, identificacion, pais_aerolinea, sw_activa, cod_pais_verificado, pais]
Index: []

In [18]:
df_aerol2['cod_pais_verificado'].isnull()

0       False
1       False
2       False
3       False
4       False
        ...
6043    False
6044    False
6045    False
6046    False
6047    False
Name: cod_pais_verificado, Length: 6048, dtype: bool

In [19]:
print(df_aerol2['cod_pais_verificado'].isnull().sum())

0

In [20]:
print(df_aerol2['cod_pais_verificado'].isnull().values.any())

False

In [21]:
print(df_aerol2.duplicated().sum())

0

In [22]:
df_aerol2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6048 entries, 0 to 6047
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   cod_aerolinea        6048 non-null   object
 1   nombre_aerolinea     6048 non-null   object
 2   cod_pais             6048 non-null   object
 3   cod_iata             6048 non-null   object
 4   cod_icao             6048 non-null   object
 5   identificacion       6037 non-null   object
 6   pais_aerolinea       6032 non-null   object
 7   sw_activa            6047 non-null   object
 8   cod_pais_verificado  6048 non-null   object
 9   pais                 6048 non-null   object
dtypes: object(10)
memory usage: 472.6+ KB

In [23]:
pd.read_sql_query('DESCRIBE dm_aerolineas;', conn)

              Field          Type Null  Key Default Extra
0     cod_aerolinea    varchar(5)   NO  PRI    None
1  nombre_aerolinea  varchar(100)   NO         None
2          cod_pais    varchar(3)  YES  MUL    None
3          cod_iata    varchar(3)  YES         None
4          cod_icao   varchar(10)  YES         None
5    identificacion  varchar(100)  YES         None
6    pais_aerolinea   varchar(45)  YES         None
7         sw_activa           int  YES         None

In [24]:
df_aerol2.sw_activa.unique()

array(['Y', 'N', nan], dtype=object)

### Convertir sw_activa (Y/N) a (1/0)

Utilizando .loc

In [25]:
# Para los valores que son 'Y', establecerlos a 1
df_aerol2.loc[df_aerol2['sw_activa'] == 'Y', 'sw_activa'] = 1

# Para los valores que no son 'Y', establecerlos a 0
df_aerol2.loc[df_aerol2['sw_activa'] != 'Y', 'sw_activa'] = 0

# Convertir la columna 'sw_activa' a tipo entero
df_aerol2['sw_activa'] = df_aerol2['sw_activa'].astype(int)

Utilizando .replace

In [26]:
df_aerol2['sw_activa'] = df_aerol2['sw_activa'].replace(['Y', 'N'], [1, 0]).astype(int)

In [27]:
df_aerol2.head()

,cod_aerolinea,nombre_aerolinea,cod_pais,cod_iata,cod_icao,identificacion,pais_aerolinea,sw_activa,cod_pais_verificado,pais
0,00001,Private flight,Z99,Z9,Z99,I999,NaN,0,Z99,desconocido
1,00002,135 Airways,USA,Z9,GNL,GENERAL,United States,0,USA,United States
2,00003,1Time Airline,ZAF,1T,RNX,NEXTIME,South Africa,0,ZAF,South Africa
3,00004,2 Sqn No 1 Elementary Flying Training School,GBR,Z9,WYT,I999,United Kingdom,0,GBR,United Kingdom
4,00005,213 Flight Unit,RUS,Z9,TFU,I999,Russia,0,RUS,Russia

### Volcado a BBDD

In [28]:
df_aerol2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6048 entries, 0 to 6047
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   cod_aerolinea        6048 non-null   object
 1   nombre_aerolinea     6048 non-null   object
 2   cod_pais             6048 non-null   object
 3   cod_iata             6048 non-null   object
 4   cod_icao             6048 non-null   object
 5   identificacion       6037 non-null   object
 6   pais_aerolinea       6032 non-null   object
 7   sw_activa            6048 non-null   int64
 8   cod_pais_verificado  6048 non-null   object
 9   pais                 6048 non-null   object
dtypes: int64(1), object(9)
memory usage: 472.6+ KB

In [29]:
pd.read_sql_query('DESCRIBE dm_aerolineas;', conn)

              Field          Type Null  Key Default Extra
0     cod_aerolinea    varchar(5)   NO  PRI    None
1  nombre_aerolinea  varchar(100)   NO         None
2          cod_pais    varchar(3)  YES  MUL    None
3          cod_iata    varchar(3)  YES         None
4          cod_icao   varchar(10)  YES         None
5    identificacion  varchar(100)  YES         None
6    pais_aerolinea   varchar(45)  YES         None
7         sw_activa           int  YES         None

Nos quedamos con a estructura definitiva:     
| Campo              | Tipo de Dato   | Acepta Nulos |
|--------------------|----------------|--------------|
| cod_aerolinea      | varchar(5)     | NOT NULL     |
| nombre_aerolinea   | varchar(100)   | NOT NULL     |
| cod_pais           | varchar(3)     | NULL         |
| cod_iata           | varchar(3)     | NULL         |
| cod_icao           | varchar(10)    | NULL         |
| identificacion     | varchar(100)   | NULL         |
| pais_aerolinea     | varchar(45)    | NULL         |
| sw_activa          | int            | NULL         |

Seleccion de columnas

In [30]:
df_aerol_def = df_aerol2.drop(['cod_pais_verificado', 'pais'],axis=1)

In [31]:
df_aerol_def.head()

,cod_aerolinea,nombre_aerolinea,cod_pais,cod_iata,cod_icao,identificacion,pais_aerolinea,sw_activa
0,00001,Private flight,Z99,Z9,Z99,I999,NaN,0
1,00002,135 Airways,USA,Z9,GNL,GENERAL,United States,0
2,00003,1Time Airline,ZAF,1T,RNX,NEXTIME,South Africa,0
3,00004,2 Sqn No 1 Elementary Flying Training School,GBR,Z9,WYT,I999,United Kingdom,0
4,00005,213 Flight Unit,RUS,Z9,TFU,I999,Russia,0

Volcado a BBDD

In [32]:
df_aerol_def.to_sql('dm_aerolineas', con = conn, if_exists = 'append', index=False)

6048

Comprobaciones de la carga

In [33]:
pd.read_sql_query('select * from dm_aerolineas limit 5;', conn)

,cod_aerolinea,nombre_aerolinea,cod_pais,cod_iata,cod_icao,identificacion,pais_aerolinea,sw_activa
0,00001,Private flight,Z99,Z9,Z99,I999,None,0
1,00002,135 Airways,USA,Z9,GNL,GENERAL,United States,0
2,00003,1Time Airline,ZAF,1T,RNX,NEXTIME,South Africa,0
3,00004,2 Sqn No 1 Elementary Flying Training School,GBR,Z9,WYT,I999,United Kingdom,0
4,00005,213 Flight Unit,RUS,Z9,TFU,I999,Russia,0

Comprobaciones conteos

In [34]:
count_df = df_aerol_def.count()
count_df

cod_aerolinea       6048
nombre_aerolinea    6048
cod_pais            6048
cod_iata            6048
cod_icao            6048
identificacion      6037
pais_aerolinea      6032
sw_activa           6048
dtype: int64

In [35]:
pd.read_sql_query('SELECT COUNT(*) FROM dm_aerolineas;', conn)

   COUNT(*)
0      6048